#auto generated file
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DLX_synthesizable/a.b-DataPath.core/DecodeUnit/syn/mydesign/constants.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DLX_synthesizable/a.b-DataPath.core/DecodeUnit/syn/mydesign/MUX4_1Generic.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DLX_synthesizable/a.b-DataPath.core/DecodeUnit/syn/mydesign/ffd.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DLX_synthesizable/a.b-DataPath.core/DecodeUnit/syn/mydesign/RegisterN.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DLX_synthesizable/a.b-DataPath.core/DecodeUnit/syn/mydesign/registerfile.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DLX_synthesizable/a.b-DataPath.core/DecodeUnit/syn/mydesign/IR_decoder.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DLX_synthesizable/a.b-DataPath.core/DecodeUnit/syn/mydesign/DU.vhd}
elaborate DU -library WORK
compile -exact_map
report_power > power_report.txt
report_area > area_report.txt
report_timing > timing_report.txt
write -hierarchy -format verilog -output /home/ms21.4/Desktop/DLX/DLX_synthesizable/a.b-DataPath.core/DecodeUnit/syn/syn_netlist.v
