#auto generated file
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DLX_synthesizable/HW_CU/syn/mydesign/constants.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DLX_synthesizable/HW_CU/syn/mydesign/ffd.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DLX_synthesizable/HW_CU/syn/mydesign/RegisterN.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DLX_synthesizable/HW_CU/syn/mydesign/HW_CU.vhd}
elaborate dlx_cu -library WORK
compile -exact_map
report_power > power_report.txt
report_area > area_report.txt
report_timing > timing_report.txt
write -hierarchy -format verilog -output /home/ms21.4/Desktop/DLX/DLX_synthesizable/HW_CU/syn/syn_netlist.v
