#auto generated file
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/constants.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/iv.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/nd2.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/mux21.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/mux21_generic.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/FA.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/RCA.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/SUM_BLOCK.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/SUM_GENERATOR.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/g_block.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/pg_block.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/pg_net.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/xorGrid.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/carry_gen.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/P4_Adder.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/01-generic_shifter.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/nd3.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/nd4.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/Logical.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/NOR2.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/AND2.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/NORN.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/MUX6_1Generic.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/comparator.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/topLevelCMP.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/MUX4_1Generic.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/ALU.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/XNOR2.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/zerodetect.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/ffd.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/RegisterN.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/ExecutionUnit/syn/mydesign/TopLevelEXU.vhd}
elaborate EXUNIT -library WORK
compile -exact_map
report_power > power_report.txt
report_area > area_report.txt
report_timing > timing_report.txt
write -hierarchy -format verilog -output /home/ms21.4/Desktop/DLX/ExecutionUnit/syn/syn_netlist.v
