#auto generated file
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DecodeUnit/syn/mydesign/constants.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DecodeUnit/syn/mydesign/iv.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DecodeUnit/syn/mydesign/nd2.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DecodeUnit/syn/mydesign/mux21.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DecodeUnit/syn/mydesign/mux21_generic.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DecodeUnit/syn/mydesign/ffd.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DecodeUnit/syn/mydesign/RegisterN.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DecodeUnit/syn/mydesign/registerfile.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DecodeUnit/syn/mydesign/IR_decoder.vhd}
analyze -library WORK -format vhdl {/home/ms21.4/Desktop/DLX/DecodeUnit/syn/mydesign/DU.vhd}
elaborate DU -library WORK
compile -exact_map
report_power > power_report.txt
report_area > area_report.txt
report_timing > timing_report.txt
write -hierarchy -format verilog -output /home/ms21.4/Desktop/DLX/DecodeUnit/syn/syn_netlist.v
